rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &err_notify_params); //acc data notification
    APP_ERROR_CHECK(ret);
}

static void characteristic_update_and_notify()
{
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t acc_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t gyr_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
    uint16_t mag_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;

    //Add the time stamp for the current data set and current number of 
    //samples to the end of each of the data characteristics.
    for (int i = 0; i < 4; i++)
    {
        uint8_t* time_start = (uint8_t*)&m_time_stamp; //cast the float to a 32-bit integer to take up 4 array slots

        acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
        mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
    }
    acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
    mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;

    //Uncomment to see raw accelerometer bytes
    //SEGGER_RTT_WriteString(0, "Accelerometer data.");
    //for (int i = 0; i < m_current_sensor_samples * 6; i++)
    //{
    //    if (i % 6 == 0) SEGGER_RTT_WriteString(0, "\n");
    //    SEGGER_RTT_printf(0, "0x%x ", acc_characteristic_data[i]);
    //}
    //SEGGER_RTT_WriteString(0, "\n\n");

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &acc_data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &mag_data_characteristic_size;
    mag_notify_params.offset = 0;

    //Set the notifcation_done boolean to false and start notifications.
    //The boolean will be set to true in the BLE handler when the notification
    //is complete, alerting us to send out the next notification.
    //m_notifications_done = 0;
    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params); //acc data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params); //gyr data notification
    ret = sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params); //mag data notification

    //if (ret == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    //{
    //    ret = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
    //    APP_ERROR_CHECK(ret);
    //}
    
    APP_ERROR_CHECK(ret); //Uncommenting this can help debug notification errors
}

uint64_t findGCD(uint64_t a, uint64_t b)
{
    if (b == 0) return a;
    return findGCD(b, a % b);
}

uint64_t findLCM(uint64_t a, uint64_t b)
{
    return (a * b) / findGCD(a, b);
}

float findDecimalLCM(float a, float b)
{
    return findLCM(a * 1000000, b * 1000000) / 1000000.0;
}

void calculate_samples_and_connection_interval_two()
{
   //Had a change of heart and am attempting a totally different strategy here.
   //We want to minimize the amount of lag that occurs with the image on screen,
   //which is accomplished by minimizing the data collection time. While testing
   //I'm going to pick a desired lag time and set the sensor samples based off of
   //that and the current odr.

   //Furthermore, it actually makes sense to have the data collection period be 
   //longer than the connection interval, so after calculating the number of 
   //samples to collect, pick the lowest multiple of 15 milliseconds less than this
   //data collection period and set that as the maximum connection interval, and
   //15 ms less than this as the minimum connection interval.

   float desired_lag_time = 0.2; //in seconds
   m_current_sensor_samples = current_sensor_odr * desired_lag_time;
   if (m_current_sensor_samples > MAX_SENSOR_SAMPLES) m_current_sensor_samples = MAX_SENSOR_SAMPLES;
   SEGGER_RTT_printf(0, "%d sensor samples have been selected.\n", m_current_sensor_samples);

   //Calculate the actual lag time in milliseconds. Subtract 1 millisecond to guarantee
   //a longer data collection time than connection interval
   int actual_lag_time = 1000.0 * m_current_sensor_samples / current_sensor_odr - 1; 
   
   desired_maximum_connection_interval = actual_lag_time - (actual_lag_time % 15); //round down to the nearst 15th millisecond
   desired_minimum_connection_interval = desired_maximum_connection_interval - 15;
}

void calculate_samples_and_connection_interval()
{
    //This method is used to select the appropriate number of sensor samples to collect
    //and the min-max connection interval to select to minimize data loss.

    //This method is necessary as a consequence of not being able to set a specific 
    //connection interval, the interval must be negotiated between two devices and thus
    //is prone to not be exactly what we want. On iOS devices, in particular, the minimumn
    //and maximum requested connection interval must be at least 15 milliseconds apart. 
    //Depending on the current sensor ODR, 15 milliseconds can be anywhere from 0.75 sensor
    //samples at an ODR of 50 Hz to 6 samples at 400 Hz. Basically, depending on what the 
    //negotiated connection interval is, it may make sense to collect more or less samples
    //at a time from the sensors in order to minimize data being overwritten.

    //Since we won't know what the actual connection interval will be until after it's
    //negotiated, we attempt to pick a min and max interval that will maximize our chances
    //of having low data loss.
    int minimum_time = ceil(1000.0 / current_sensor_odr);
    minimum_time += (15 - minimum_time % 15);

